<h1>619.Biggest Single Number</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Table <code>my_number</code> contains many numbers in column <b>num</b> including duplicated ones.<br />
Can you write a SQL query to find the biggest number, which only appears once.</p>

<pre>
+---+
|num|
+---+
| 8 |
| 8 |
| 3 |
| 3 |
| 1 |
| 4 |
| 5 |
| 6 | 
</pre>
For the sample data above, your query should return the following result:

<pre>
+---+
|num|
+---+
| 6 |
</pre>
<b>Note:</b><br />
If there is no such number, just output <b>null</b>.

<p>&nbsp;</p>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
my_number = pd.read_sql_table("my_number", engine)
my_number

   num
0    8
1    8
2    3
3    3
4    1
5    4
6    5
7    6

In [3]:
# Method 1: PARTITION BY
query = '''
SELECT IFNULL(MAX(num), NULL) as num
FROM (SELECT num, 
             COUNT(num) OVER (PARTITION BY num) count
      FROM my_number) temp
WHERE count = 1;
'''
pd.read_sql_query(query, engine)

   num
0    6

In [4]:
# Method 2: GROUP BY, HAVING, ORDER BY
query = '''
SELECT IFNULL(num, NULL) num
FROM my_number
GROUP BY num
HAVING count(*) = 1
ORDER BY num DESC
LIMIT 1;
'''
pd.read_sql_query(query, engine)

   num
0    6